<?php

declare(strict_types=1);

return [
    'logged_in' => 'Вход выполнен: :name',
    'create_account' => 'Создайте учетную запись, пока это уведомление не исчезнет, чтобы определить свою NFC-карту',
    'card_created' => 'Карта создана: :title',
    'card_updated' => 'Карта обновлена',
    'card_deleted' => 'Карта удалена: :title',
    'card_not_deleted' => 'Мы не разрешаем удалять вашу последнюю карту',
    'card_switched' => 'Переключение между картами',
    'card_redirected' => 'Зарегистрируйтесь или войдите в систему; после входа с этого браузера ваша карта будет автоматически распознана для последующего аккаунта.',
    'information_created' => 'Успешно добавлено',
    'information_updated' => 'Успешно обновлено',
    'information_deleted' => 'Успешно удалено',
    'image_ratio_error' => 'Изображения должны быть в соотношении сторон 1/1.',
    'image_extension_error' => 'Изображения должны быть в формате JPEG или PNG.',
    'invalid_data_structure' => 'Данная структура данных не подходит для этого приложения.',
    "information_exist" => 'Эти данные уже существуют для этой карты.',
    "card_imported" => 'Импортированные данные: :created, Конфликтующие данные: :skipped',
    "invalid_app" => 'Выбрано недопустимое приложение.',
    "card_not_found" => 'Карта не найдена',
    "max_pdf" => "Вы достигли максимального лимита загрузки файлов."
];
